[
    {
      "text": "Just saw a LinkedIn Influencer with Organic Growth written in the profile with 65K+ followers claiming that he can help you in growing your platform copying the posts from other influencers.",
      "engagement": 90
    },
    {
    "text": "Jobseekers, this ones for you. Every application every interview every follow-up… the pressure is immense. And I know what youre thinking: Am I not good enough? But let me tell you this isnt about you or your skills. Its about a broken system where 60% of applicants never hear back. Your mental health is not worth sacrificing for a system that doesnt acknowledge your worth. Please remember taking care of yourself is the real priority. Your dream job will come but for now breathe.",
      "engagement": 347
    },
    {
      "text": "Looking for jobs on LinkedIn is like online dating: Full of promises but in the end youre just left ghosted.",
      "engagement": 109
    },
    {
      "text": "LinkedIn scams be like: Congratulations youve been selected for a role you didnt even apply for! The catch? Pay Rs. 50,000 for the honor.",
      "engagement": 115
    },
    {
      "text": "sapne dekhna achi baat hai lekin job ka sapna dekh ke interested likhna yeh toh achi baat nahi hai na?",
      "engagement": 545
    },
    {
      "text": "Next time when Ill be reading some LinkedIn Influencers story, I am starting from the last line. If theres a link attached to it, its most probably a fake one. Saves me time!",
      "engagement": 188
    },
    {
      "text": "Every time I poured my heart into 5-6 rounds of interviews and faced rejection, it felt like a punch in the gut. The sleepless nights, the endless preparation, all for nothing. But looking back, I realize it wasnt nothing. It was the Universes way of saying, Not this one, something better is on the way. Every single time, Ive been shown why that rejection happened. Doors I thought I wanted to walk through were shut, only to have the right ones swing open. The kind that aligned with my growth, my values, and my happiness. At first, it stung. It hurt deeply. But now, when things dont go as planned, I dont panic. I dont question my worth. I sit back, breathe, and trust. The Universe knows. I know theres another plan waiting. Something bigger, better, and just for me. To anyone feeling the weight of rejection: trust that the closed doors are protecting you from something you cant see right now. Your path is being cleared for something even more beautiful.",
      "engagement": 206
    },
    {
      "text": "To everyone whos still looking for a job... I see you. I feel you.  Every rejection email feels like a punch in the gut, and every Well get back to you sounds more like Youll never hear from us. But I want you to know, youre not alone in this. 🌸According to a study, 80% of jobseekers struggle with anxiety and self-doubt during their search. Its normal to feel lost, but its not the end. Take breaks, breathe, and remember, this doesnt define you. Your worth is not tied to an offer letter.  Your mental health matters more than any job.",
      "engagement": 899
    },
    {
      "text": "Sometimes, we forget that a companys brand name doesnt define someones talent. Its easy to get caught up in the big company = big talent mindset, but thats not always the case. Ive had the privilege of working with people from smaller companies (lesser known) who blow me away with their skills and dedication. They dont need a fancy title or a famous brand behind them to prove their worth. Ive seen the other side too—people in top-tier companies feeling lost, overwhelmed, or stuck, even though the world sees them as successful. Lets stop attaching someones value to the company they work for. Freshers especially need to hear this—skills are what matter, not the size of the company behind them. At the end of the day, happiness and growth dont come from a brand name, they come from doing what you love and constantly improving your craft.",
      "engagement": 166
    },
    {
      "text": "So when I left a toxic work environment, I told my manager a simple thing and felt so good  I just said- Hope your son gets a manager like you. I hope that the manager behaves the same way as you did with me. Thank you. Now tell me 1 thing- She always said that she was a great manager. Why will she get offended? I just told her that I wish her son would get a manager like she was. If you felt bad, then that means you were a bad manager and now you know it. If you feel good, then take it as a blessing for your son and youll really want someone to treat your son/daughter in the same way. She cannot be even angry with me else itll prove that she was not a great manager. Muskan - 1 Manager - 0 Muskan -> Aura +100000000 (Fictional message unfortunately :( ) Hope you all become the people that your sons/daughters will like to work under  There are a lot of bad people/things, bring a small change and break the chain :)",
      "engagement": 1111
    }
  ]
  